"""
Íàïèøèòå ôóíêöèþ êîòîðàÿ ïðèíèìàåò 2 ÷èñëà è âûâîäèò âñå ÷èñëà ìåæäó íèìè êîòîðûå äåëÿòñÿ íà 3.
Íàïèøèòå äåêîðàòîð êîòîðûé âûâîäèò ôðàçó:
"Äàííàÿ ôóíêöèÿ âûâîäèò âñå ÷èñëà ìåæäó ×èñëî À è ×èñëî Á"(ñþäà ïîäñòàâüòå ÷èñëà ÷òî ïðèíèìàåò ôóíêöèÿ)
è îáåðíèòå ôóíêöèþ ÷òîáû äàííàÿ ôðàçà âûâîäèëàñü ïåðåä åå âûïîëíåíèåì
"""
def decorate(f):
    print('Äàííàÿ ôóíêöèÿ âûâîäèò âñå ÷èñëà ìåæäó ' + str(f[0]) + ' è ' + str(f[1]))
    print(*f[2:])

def func(a, b):
    stack = [a, b]
    for i in range(a, b + 1):
        if i % 3 == 0:
            stack.append(i)
    return stack

decorate(func(int(input('Enter number: ')), int(input('Enter number: '))))